In [1]:
import pandas as pd
import numpy as np

In [3]:
tn = pd.read_csv("titanic.csv")
tn.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
tn.rename({"PassengerId":"id", "Survived":"survived", "Pclass":"class", "Sex":"sex"}, axis="columns") \
  .set_index("id") \
  .pipe(lambda df: df[["survived", "class", "sex"]]) \
  .head()

    survived  class     sex
id
1          0      3    male
2          1      1  female
3          1      3  female
4          1      1  female
5          0      3    male

In [5]:
withage = tn[tn["Age"].notna()]
withage \
  .groupby((withage["Age"]/10).astype(int)).agg({"Survived":"sum", "PassengerId":"count"}) \
  .rename({"PassengerId":"Total"},axis=1) \
  .pipe(lambda df: df.assign(Rate=(df["Survived"]/df["Total"]).round(2)))

     Survived  Total  Rate
Age
0          38     62  0.61
1          41    102  0.40
2          77    220  0.35
3          73    167  0.44
4          34     89  0.38
5          20     48  0.42
6           6     19  0.32
7           0      6  0.00
8           1      1  1.00

In [6]:
def bydecade(df, col):
  return df.groupby((df[col]/10).astype(int)).count()

bydecade(tn.dropna(), "Age")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Age,,,,,,,,,,,,
0,10,10,10,10,10,10,10,10,10,10,10,10
1,19,19,19,19,19,19,19,19,19,19,19,19
2,36,36,36,36,36,36,36,36,36,36,36,36
3,49,49,49,49,49,49,49,49,49,49,49,49
4,33,33,33,33,33,33,33,33,33,33,33,33
5,24,24,24,24,24,24,24,24,24,24,24,24
6,9,9,9,9,9,9,9,9,9,9,9,9
7,2,2,2,2,2,2,2,2,2,2,2,2
8,1,1,1,1,1,1,1,1,1,1,1,1

In [7]:
df = pd.DataFrame({'row': ['a', 'a', 'b', 'b'],
                   'col': ['x', 'y', 'x', 'y'],
                   'val': [1, 2, 3, 4 ] })
df

  row col  val
0   a   x    1
1   a   y    2
2   b   x    3
3   b   y    4

In [8]:
pd.pivot(df, index="row", columns="col", values="val")

col  x  y
row
a    1  2
b    3  4